[
    {
      "guid": "0ba4997c-0c20-40f8-b3b1-4f2098186f40",
      "review_body": "Texas Tech's campus is a wonderful place to live and be around people from all types of backgrounds. It's relatively big so after getting used to the places around campus it's nice to be able to walk around and know where everything is, from your classes to the best food options available.",
      "rating": 4,
      "author": "Freshman",
      "created": "2021-09-14T18:41:30.585918Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "2acf35c3-69f0-4ca0-a3f1-05874a1e9d61",
      "review_body": "The staff is very helpful and kind to everyone. Their office hours are very reasonable and accessible. Also, there are many locations to study. Unfortunately, there are no specific programs that will help me achieve my specific career goals. I want to be a game designer, and there are no specific programs available that meet my academic needs to achieve my career goal. Also, certain dormitories are poorly maintained and therefore have issues with air conditioning, lighting, water pressure, water temperature, etc.",
      "rating": 3,
      "author": "Freshman",
      "created": "2021-09-12T21:55:54.757485Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "1b462a3f-17f2-445e-b45f-684f16cd474a",
      "review_body": "I love West Texas, but there is not a whole lot to do besides: school, hanging out with friends, and other social activities. The people are very friendly and welcoming, but because its a big party school, its easy to get distracted. This place is a very \"love/hate\" relationship but we do have a lot of pride! Wreck em",
      "rating": 3,
      "author": "Junior",
      "created": "2021-09-07T23:08:17.402697Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "dec31a3b-7e36-4cb5-8d1c-b5f6f8ffdcc0",
      "review_body": "Love everything about to school from the classes to the game days. Even the long walks are bearable just due to the beauty of the campus. Education is superb and everyone is willing to help out.",
      "rating": 5,
      "author": "Senior",
      "created": "2021-08-31T13:54:30.611718Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "ce76d779-7881-4d53-89c7-a37fc5394ed9",
      "review_body": "Great university with beautiful campus and high quality education, the university sports are also great!",
      "rating": 5,
      "author": "Alum",
      "created": "2021-08-20T13:37:45.639162Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "0ec28f11-902a-4641-a5ab-e33ac598ea9d",
      "review_body": "Texas Tech University is great for people looking to go into the sciences. It has plenty of classes with good professors and they have excellent research facilities for students to get involved in.",
      "rating": 4,
      "author": "Senior",
      "created": "2021-08-20T02:30:18.243211Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "682e4293-85f4-4d56-aef8-979bbf168013",
      "review_body": "I'm entering Texas Tech this upcoming Fall, and I am very excited. I'm a transfer student, so I understand the in's and out's of what makes a college good or not, and I am very comfortable giving Texas Tech this 4 star rating.",
      "rating": 4,
      "author": "Junior",
      "created": "2021-08-09T22:39:47.347208Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "36a2acc9-f2b3-45ab-80a2-3215d6a4d996",
      "review_body": "So far I'm really liking Texas Tech University. The people are friendly, the classes are great and not too hard, and the professors respond quickly to emails. If there was one thing I could change, it would be the tuition. So far, it's been pretty expensive, but I'd really like to see new first-year students not have to worry so much about cost their first year.",
      "rating": 4,
      "author": "Sophomore",
      "created": "2021-08-01T10:09:03.810501Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "c32176c7-d468-4a8a-b99f-2ff3472b945b",
      "review_body": "I really like the environment of the campus. Everyone is so nice and welcoming. The campus life their feels like home.",
      "rating": 5,
      "author": "Sophomore",
      "created": "2021-07-15T22:36:11.185268Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "f5b475dc-29d6-4140-9fe4-d34b2a0bcc30",
      "review_body": "I really enjoy the experience I have a good time learning the subjects from most of the professors. I think what I would change is the amount of money that I have spent on things like printing and supplies.",
      "rating": 4,
      "author": "Junior",
      "created": "2021-07-14T19:12:31.013932Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "b8204131-4cd1-4b6f-9ffa-efd3c5bffa20",
      "review_body": "Texas Tech University was a really nice place to study in. Even though covid made it hard to go out and interact with other students and professors, it was an overall new and exciting experience as a college freshman in the university's online educational world. What I liked a lot about Texas Tech was this peaceful feeling of a community that I felt all the time whether I went someplace or whether I did something like study, eat, or even just relax. Many of my professors were really accessible, lenient, and understanding of college student life. At the same time, courses offer multiple opportunities to work with other students allowing you to grow your ability to work with others, improve your leadership ability, increase your friend circle, and present knowledge in multiple different aspects. Overall going to Texas Tech was a life-changing step in my life and the only thing I'd like to see change its habitat before Covid.",
      "rating": 4,
      "author": "Sophomore",
      "created": "2021-07-13T21:34:31.613619Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "813fb72f-e249-429a-9491-566ed2e913d2",
      "review_body": "I have yet to experience what this college will be like, but I can say I am very excited to start this fall.",
      "rating": 4,
      "author": "Freshman",
      "created": "2021-06-30T04:26:32.663428Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "90719b3d-72d0-476b-b682-7ad132b3fed5",
      "review_body": "Very nice student population, beautiful campus, and an overall fun place to be. I just finished my freshman year, living in Gates Residence Hall and had a really great experience. I am currently an accounting major and cannot wait to go back!",
      "rating": 5,
      "author": "Sophomore",
      "created": "2021-06-24T03:00:01.656415Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "5d19ca21-b0d7-4a04-89e5-39c43a8418c0",
      "review_body": "Texas Tech is a great school for those that want a big school feels but a small-time vibe. Many students participate in the school-wide events and",
      "rating": 4,
      "author": "Freshman",
      "created": "2021-06-23T19:21:14.009544Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "091050f7-a75b-4209-ae2a-56135edd086d",
      "review_body": "Texas Tech University is a great school! Being that I am a senior and will be graduating this upcoming december, reflecting back my overall time at thus University has been great! I strongly feel that the education being taught is top notch and has helped me gain the skills needed to succeed out in the real world. The professors (for the most part, with a few acceptions) truly care and want their students to succeed, they care about the students well-being and are very willing to take extra time out of their day to assist if needed. Of course every university has its negatives, of course since this is a PWI, the diversity is there but not prevelant, but not to the point where it makes POC uncomfortable. As well as the distance and location of the school as well, being in West Texas (Lubbock TX), it is far from other big cities such as Houston, Austin, San Antonio, so there isn't that much to do out there. But the university does accomodate for that by always having campus activities.",
      "rating": 4,
      "author": "Senior",
      "created": "2021-06-16T16:09:37.747613Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "5c5b7cc2-b430-4b8b-a630-022ceeb69213",
      "review_body": "it is good  and think   it can help me to reach my goal in my life  and it can help my family  i think in some way thf",
      "rating": 3,
      "author": "Freshman",
      "created": "2021-06-09T17:49:01.72773Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "75ac155e-ed46-44c7-ad14-a443971be87e",
      "review_body": "Online classes were very clear and precise about assignments and their due dates.  My professors also sent emails that included reminders about important dates and reminders for quizzes and tests.\nSome online classes included interaction with the professors which helped to provide clarity on more complex ideas and concepts, however, the technology available sometimes made it difficult for professors to show slides or for students to even hear the lectures.",
      "rating": 3,
      "author": "Sophomore",
      "created": "2021-05-21T01:24:19.43832Z",
      "categories": [
        "Online Learning"
      ]
    },
    {
      "guid": "269fe1eb-cd47-4a4a-ab43-033068b9a22e",
      "review_body": "Professors are happy to help and have a way for you to get in contact with them in the class syllabus if you have any questions about assignments or upcoming tests.  CAs in the dorms are also willing to help out, especially during move-in and finals week.  Others who live in your dorm are also often able to help clarify any classes you may have in common and even lend you personal help ranging from tutoring or preparing for a Greek event.\nThe people you meet in student organizations are very welcoming, and from my experience are nearly always willing to provide help as study buddies or lend a hand when it comes to personal projects you may find yourself working on.",
      "rating": 4,
      "author": "Sophomore",
      "created": "2021-05-21T01:24:19.43832Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "20e4ef7c-1ce4-4434-bdf2-8e503096d510",
      "review_body": "Texas Tech is a good school for someone who really wants to be immersed in the party scene. As far as academics, it really is what you make of it.",
      "rating": 3,
      "author": "Sophomore",
      "created": "2021-05-20T04:57:35.377403Z",
      "categories": [
        "Overall Experience"
      ]
    },
    {
      "guid": "0f38fc5a-87f4-452e-aa3f-5ceedf5a6fd1",
      "review_body": "Classes online are really determined by the professor. It's either really easy to keep up with or the workload is extremely overwhelming depending on the professor.",
      "rating": 4,
      "author": "Sophomore",
      "created": "2021-05-20T04:57:35.377403Z",
      "categories": [
        "Online Learning"
      ]
    }
]